app/controllers/powers_controller.rb

  def index
    powers = Power.all
---
SELECT "powers".* FROM "powers"

  def find_power
    @power = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]